[
  {
    "name": "Monsignor Morrison",
    "subtitle": "Sleek School With Peak Education system & Students",
    "type": "Catholic",
    "levelType": "Middle",
    "pros": [
      "Peak Education",
      "Friendly Staff",
      "Easy 2 Understand",
      "Lots Of Events",
      "Welcoming",
      "Sleek Library"
    ],
    "cons": [
      "Vandalizing",
      "Busses",
      "School Quality",
      "Low Quality Air",
      "Mid Size"
    ],
    "level": 8,
    "website": "https://mor.ldcsb.ca/",
    "info": "Monsignor Morrison is a small, friendly Catholic school in St. Thomas that's part of the LDCSB. It's known for its supportive teachers, close community vibe, and focus on both learning and faith. A lot of families like it for its welcoming atmosphere and tight-knit feel."
  },
  {
    "name": "St. Mary's Catholic High School",
    "subtitle": "Large, diverse high school with strong academics and athletics",
    "type": "Catholic",
    "levelType": "HighSchool",
    "pros": [
      "Strong academic programs",
      "French Immersion",
      "SHSM programs",
      "Active sports teams",
      "Supportive environment",
      "Lots of extracurriculars"
    ],
    "level": 6,
    "website": "https://smh.ldcsb.ca/",
    "info": "Lowkey I'm not too familiar with St Mary's but i've heard they're quite motivated & Awesome Staff"
  },
  {
    "name": "St. Anne's Catholic Elementary School",
    "subtitle": "Large Catholic elementary school with strong community and extracurricular programs",
    "type": "Catholic",
    "levelType": "Elementary",
    "pros": [
      "French Immersion",
      "Strong academic performance",
      "Faith-based education",
      "Diverse extracurricular activities",
      "Supportive community"
    ],
    "level": 8,
    "website": "https://ans.ldcsb.ca/",
    "info": "St. Anne's Catholic Elementary School, established in 2009, is a Catholic elementary school located in St. Thomas, Ontario. Serving students from Junior Kindergarten to Grade 8, it offers a comprehensive French Immersion program and is known for its strong academic performance. The school emphasizes faith-based education and provides a variety of extracurricular activities to support student development."
  },
  {
    "name": "John Wise Public School",
    "subtitle": "A vibrant JK–8 elementary school in St. Thomas, Ontario",
    "type": "Public",
    "levelType": "Elementary",
    "pros": [
      "Modern facilities",
      "strong academic support",
      "inclusive programs",
      "active community",
      "new playground"
    ],
    "level": 6,
    "website": "https://johnwise.tvdsb.ca/en/index.aspx",
    "info": "John Wise Public School is part of the Thames Valley District School Board and serves students from Junior Kindergarten to Grade 8. Located at 100 Parkside Drive in St. Thomas, Ontario, the school focuses on student well-being, academic excellence, and community engagement. With approximately 575 students, it offers language programs, special education support, and a range of extracurricular activities."
  },
  {
    "name": "Locke's Public School",
    "subtitle": "A community-focused JK–8 school in St. Thomas, Ontario",
    "type": "Public",
    "levelType": "Elementary",
    "pros": [
      "Active parent involvement",
      "inclusive environment",
      "strong community ties",
      "dedicated staff"
    ],
    "level": 5,
    "website": "https://lockes.tvdsb.ca/en/index.aspx",
    "info": "Locke's Public School, part of the Thames Valley District School Board, serves students from Junior Kindergarten to Grade 8. Located at 20 South Edgeware Road in St. Thomas, Ontario, the school emphasizes academic excellence, character development, and community engagement. With a commitment to providing a well-rounded education, Locke's offers a comprehensive curriculum and various programs to support student growth and success."
  },
  {
    "name": "Forest Park Public School",
    "subtitle": "A JK–8 public school in St. Thomas with room for growth",
    "type": "Public",
    "levelType": "Elementary",
    "pros": [
      "Small class sizes",
      "EarlyON Centre on-site",
      "strong reading support",
      "community involvement"
    ],
    "level": 4,
    "website": "https://forestpark.tvdsb.ca/en/index.aspx",
    "info": "Forest Park Public School, part of the Thames Valley District School Board, serves students from Junior Kindergarten to Grade 8. Located at 295 Forest Avenue in St. Thomas, Ontario, the school has an enrollment of approximately 538 students. It offers small class sizes and hosts an EarlyON Child and Family Centre, providing resources for families with children up to age 6. While the school demonstrates strengths in reading proficiency, with 64% of Grade 6 students meeting provincial standards, it faces challenges in mathematics, where only 39% of Grade 6 students meet the standard. The school is committed to continuous improvement and community engagement."
  },
  {
    "name": "King's Academy",
    "subtitle": "Private Christian JK–8 school in St. Thomas, Ontario",
    "type": "Private",
    "levelType": "Elementary",
    "pros": [
      "Faith-based education",
      "small class sizes",
      "strong community involvement",
      "affordable tuition"
    ],
    "level": 5,
    "website": "https://www.kingsacademycanada.com/",
    "info": "King's Academy is a private Christian school offering education from Junior Kindergarten to Grade 8 in St. Thomas, Ontario. The school emphasizes a faith-based curriculum and a close-knit community atmosphere. As of the 2025/2026 school year, King's Academy is relocating to a new facility at 410 Sunset Drive, enhancing its capacity to serve students and families. The school maintains affordable tuition rates and offers various opportunities for parental involvement and community engagement."
  },
  {
    "name": "Southwold Public School",
    "subtitle": "A rural JK–8 school near St. Thomas with about 650 students",
    "type": "Public",
    "levelType": "Middle",
    "pros": [
      "Small class sizes",
      "good test scores",
      "friendly staff",
      "strong parent support",
      "and eco-friendly programs"
    ],
    "level": 6,
    "website": "https://southwold.tvdsb.ca/en/index.aspx",
    "info": "A rural school west of St. Thomas. Runs from JK to Grade 8 with solid academics, arts, and sports. Bussing is provided."
  },
  {
    "name": "St. Joseph's Catholic High School",
    "subtitle": "Catholic high school in St. Thomas with around 960 students",
    "type": "Catholic",
    "levelType": "HighSchool",
    "pros": [
      "Strong literacy results",
      "active sports and arts programs",
      "supportive community"
    ],
    "level": 6,
    "website": "https://sjh.ldcsb.ca/",
    "info": "St. Joe's serves grades 9–12 with about 960 students. Offers a variety of academic and extracurricular programs. Literacy scores are solid, though math performance is slightly below the provincial average."
  },
  {
    "name": "Mother Teresa Catholic Secondary School",
    "subtitle": "Large Catholic high school in north London with over 1,400 students",
    "type": "Catholic",
    "levelType": "HighSchool",
    "pros": [
      "Wide range of academic and extracurricular programs",
      "including AP and French Immersion; strong community involvement"
    ],
    "level": 7,
    "website": "https://mts.ldcsb.ca/",
    "info": "Established in 2000, MTS serves grades 9–12 with a diverse student body. Offers programs like Pre-AP, French Immersion, and Specialist High Skills Majors. While academics are solid, some areas like math performance are average. Known for its active arts and athletics programs."
  },
  {
    "name": "Elgin Court Public School",
    "subtitle": "JK–8 public school in south St. Thomas with about 305 students",
    "type": "Public",
    "levelType": "Middle",
    "pros": [
      "Small student population",
      "active PTA",
      "offers academics",
      "arts",
      "and sports"
    ],
    "level": 5,
    "website": "https://elgincourt.tvdsb.ca/en/index.aspx",
    "info": "A JK–8 school in south St. Thomas with around 305 students. Offers a range of programs including academics, arts, and athletics. EQAO scores are average; math performance could improve."
  },
  {
    "name": "White Oaks Public School",
    "subtitle": "Large JK–8 public school in south London with over 1,000 students",
    "type": "Public",
    "levelType": "Middle",
    "pros": [
      "Offers French Immersion",
      "diverse community",
      "strong extracurricular programs"
    ],
    "level": 8,
    "website": "https://whiteoaks.tvdsb.ca/en/index.aspx",
    "info": "A JK–8 school in south London with over 1,000 students. Offers French Immersion and various programs. EQAO scores are below average; math performance needs improvement."
  },
  {
    "name": "Summerside Public School",
    "subtitle": "New JK–8 public school in southeast London with about 550 students",
    "type": "Public",
    "levelType": "Middle",
    "pros": [
      "Modern facilities",
      "diverse programs",
      "active parent community"
    ],
    "level": 5,
    "website": "https://summerside.tvdsb.ca/en/index.aspx",
    "info": "Opened in 2022, Summerside serves JK–8 students in southeast London. With a capacity of 556 students and 88 child care spaces, the school offers various programs. As a new school, EQAO data is limited, but early indicators suggest average performance."
  },
  {
    "name": "St. Anthony French Immersion Catholic School",
    "subtitle": "JK–8 Catholic French Immersion school in London with about 470 students",
    "type": "Catholic",
    "levelType": "Middle",
    "pros": [
      "French Immersion program",
      "diverse community",
      "strong faith-based education"
    ],
    "level": 5,
    "website": "https://ant.ldcsb.ca/",
    "info": "Located in the White Oaks area of London, St. Anthony offers French Immersion from SK to Grade 8, with two JK classes in English. The school has a diverse student body and emphasizes Catholic values. EQAO data is not publicly available; academic performance is presumed average."
  },
  {
    "name": "Sir Arthur Carty Catholic School",
    "subtitle": "JK–8 Catholic school in south London with a diverse student body",
    "type": "Catholic",
    "levelType": "Middle",
    "pros": [
      "Inclusive environment",
      "strong community support",
      "faith-based education"
    ],
    "level": 4,
    "website": "https://crt.ldcsb.ca/",
    "info": "Located in south London, Sir Arthur Carty serves JK–8 students and is known for its diverse and inclusive community. EQAO scores are below provincial averages, particularly in math, indicating areas for academic improvement."
  },
  {
    "name": "Kettle Creek Public School",
    "subtitle": "JK–8 public school in St. Thomas with a strong community focus",
    "type": "Public",
    "levelType": "Middle",
    "pros": [
      "Active parent involvement",
      "supportive staff",
      "inclusive environment"
    ],
    "level": 5,
    "website": "https://kettlecreek.tvdsb.ca/",
    "info": "A JK–8 school in St. Thomas offering a range of programs. The school emphasizes community engagement and inclusivity. EQAO scores are not publicly available; academic performance is presumed average."
  },
  {
    "name": "Ashley Oaks Public School",
    "subtitle": "JK–8 public school in south London with a diverse student body",
    "type": "Public",
    "levelType": "Middle School",
    "pros": [
      "Diverse community",
      "inclusive programs",
      "active extracurriculars"
    ],
    "level": 4,
    "website": "https://ashleyoaks.tvdsb.ca/en/index.aspx",
    "info": "A JK–8 school in south London with approximately 532 students. The school serves a culturally diverse population, including many newcomers to Canada. EQAO scores are below provincial averages, indicating areas for academic improvement."
  },
  {
    "name": "Arthur Voaden Secondary School",
    "subtitle": "Public high school in St. Thomas with a focus on technology and trades",
    "type": "Public",
    "levelType": "HighSchool",
    "pros": [
      "Specialized programs in trades and technology",
      "supportive community",
      "vocational pathways"
    ],
    "level": 3,
    "website": "https://arthurvoaden.tvdsb.ca/en/index.aspx",
    "info": "Serving grades 9–12 with approximately 380 students, Arthur Voaden offers Specialist High Skills Majors in areas like construction, healthcare, and hospitality. While the school provides valuable vocational training, recent EQAO scores are below provincial averages, indicating areas for academic improvement."
  },
  {
    "name": "Catholic Central High School",
    "subtitle": "Downtown London Catholic high school with over 1,100 students",
    "type": "Catholic",
    "levelType": "HighSchool",
    "pros": [
      "Offers IB program",
      "diverse student body",
      "strong arts and athletics programs"
    ],
    "level": 7,
    "website": "https://cch.ldcsb.ca/",
    "info": "Serving grades 9–12 with approximately 1,180 students, Catholic Central offers the International Baccalaureate program and various extracurricular activities. While the school provides a range of programs, recent EQAO scores indicate room for academic improvement."
  }
]